---
type: IPointSetIterator
namespace: Autodesk.Revit.DB.PointClouds
version: 2024
members: 2
tags: [revit-api, class]
---

# IPointSetIterator

`Autodesk.Revit.DB.PointClouds.IPointSetIterator` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Free | 2012 | `void Free ()` |
| Method | ReadPoints | 2012 | `int ReadPoints ( IntPtr buffer , int bufferSize )` |